swak4Foam/Examples/RegionSolvers/cavityAndPlate/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         400;

deltaT          0.05;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.3;

maxDeltaT       1;

libs (
    "libsimpleRegionSolvers.so"
    "libsimpleSwakFunctionObjects.so"
    "libswakFunctionObjects.so"
    //    "libswakTopoSources.so"
    "libswakSourceFields.so"
    "libgroovyBC.so"
    "libgroovyStandardBCs.so"
);

functions {
    // loadPseudoD {
    //     type readAndUpdateFields;
    //     fields (
    //         D
    //     );
    // }
    solvePlateHole {
        type solidDisplacementRegionSolver;
        meshRegion plateHole;
        ignore_unimplemented_SimpleRegionSolverFunctionObject::movePoints true;
    }
    displacement {
        type swakExpression;
        valueType internalField;
        region plateHole;
        verbose true;
        accumulations (
            min
            max
        );
        expression "D";
        ignore_unimplemented_simpleFunctionObject::movePoints true;
    }
    temperatureCavity {
        type swakExpression;
        valueType internalField;
        verbose true;
        accumulations (
            min
            weightedQuantile0.01
            weightedAverage
            weightedQuantile0.99
            max
        );
        expression "T";
        ignore_unimplemented_simpleFunctionObject::movePoints true;
    }
    temperaturePlate {
        $temperatureCavity;
        region plateHole;
    }
}

DebugSwitches {
    // PatchValueExpressionDriver 1;
}

  // *************************************************************************
  // //
